# Daily 협업일지

### [1] 오늘 날짜 / 이름 / 팀명

- 날짜: 2026/02/09
- 이름: 고대권
- 팀명: 3팀

---

### [2] 오늘 맡은 역할 및 구체적인 작업 내용

> 오늘 당신이 맡았던 역할은 무엇이었고, 어떤 작업을 수행했나요?

✍️ 답변:

```
Project Management

발표 자료 중점적으로 제작 및 본인 역할에 맞는 분량 선정

Github Repo PR 피드백 및 수정

```

---

### [3] 오늘 작업 완료도 체크 (하나만 체크)

> 진척 상황을 정량적으로 표시하고, 간단한 근거도 작성하세요.
> 
- [ ]  🔴 0% (시작 못함)
- [ ]  🟠 25% (시작은 했지만 진척 없음)
- [V]  🟡 50% (진행 중, 절반 이하)
- [ ]  🔵 75% (거의 완료됨)
- [ ]  🟢 100% (완료 및 점검까지 완료)

📌 간단한 근거:

```
다양한 기법 적용으로 Dramatic한 성능을 낼 수 있는지 여러가지 시행중. 

발표시간 후, 멘토링 시간에 우리만의 특별함을 살릴 수 있는 요소가 무엇인가에 대해 떠오른 점으론, 

일부로 적은 데이터(Project에서 지급한 기본 Data만을 기용)로 증강을 진행해, 최대한의 성능을 내보는 방식으로 프로젝트를 진행. 

이는 예산등의 문제로 다양한 raw data를 공급하기 어려운 상황을 가정하여, 최대한의 성능을 내도록 Cost 대비 높은 효율이 나오는 방향으로 진행.


```

---

### [4] 오늘 협업 중 제안하거나 피드백한 내용이 있다면?

> 오늘 회의나 메시지에서 당신이 제안하거나 팀에 피드백한 내용은 무엇인가요?
> 

✍️ 답변:

```
Repo에 올라온 PR 코드 다양하게 피드백 후, merge 작업 수행.


```

---

### [5] 오늘 분석/실험 중 얻은 인사이트나 발견한 문제점은?

> EDA, 모델 실험 중 유의미한 점이나 오류가 있었다면 자유롭게 작성하세요.
> 

✍️ 답변:

```
모델 실험 중 큰 성능 상승/하락을 보이는 지표가 딱히 나타나지 않아, 이에 대해 여러 테스트 진행 예정


```

---

### [6] 일정 지연이나 협업 중 어려웠던 점이 있다면?

> 자기 업무 외에도 전체 일정이나 팀 내 협업에서 생긴 문제를 공유해 주세요.
> 

✍️ 답변:

```
Local에서 일부 인원은 코드 작동이 되나, 일부 인원은 작동되지 않음.

이에 대해서도 수정 예정

....


```

---

### [7] 오늘 발표 준비나 커뮤니케이션에서 기여한 부분은?

> 슬라이드 제작, 발표 연습, 질문 정리 등 발표와 관련된 활동을 썼다면 기록하세요.
> 

✍️ 답변:

```
현재 작업 중인 과정 및 결과 전부 PPT로 제작하여 기재. 이후 중간 발표 시행

```

---

### [8] 내일 목표 / 할 일

> 구체적인 개인 업무나 팀 목표 기반 계획을 간단히 적어주세요.
> 

✍️ 답변:

```
Repo에 코드 실행 파일 기재, 방향성 정립, 오류 해결

```
