# Daily 협업일지

### [1] 오늘 날짜 / 이름 / 팀명

- 날짜: 2026/02/03
- 이름: 고대권
- 팀명: 3팀

---

### [2] 오늘 맡은 역할 및 구체적인 작업 내용

> 오늘 당신이 맡았던 역할은 무엇이었고, 어떤 작업을 수행했나요?

✍️ 답변:

```
Project Management

YOLOv11(m): 모자이크 & mixup 적용, 전처리 적용(수민님&민선님이 작업하신 코드)된 사항에 대해, Kaggle에 제출하여 
1차적으로 성능 점수 확인. 

해당 모델의 Test를 시행해보니 객체 좌표는 잘 잡히는 편이며 & BBox 다수 잡힘: 후처리 후, 정확도 떨어지는 문제.

Kaggle 결과) 
Public score: 0.92142
(YOLOv11(m): Mosaic & mixup, 전처리 작업 적용, conf = 0.001, Iou = 0.5) < 
Public score: 0.91764
(YOLOv11(m): Mosaic & mixup, 전처리 작업 적용, conf = 0.01, Iou = 0.2)

```

---

### [3] 오늘 작업 완료도 체크 (하나만 체크)

> 진척 상황을 정량적으로 표시하고, 간단한 근거도 작성하세요.
> 
- [ ]  🔴 0% (시작 못함)
- [ ]  🟠 25% (시작은 했지만 진척 없음)
- [V]  🟡 50% (진행 중, 절반 이하)
- [ ]  🔵 75% (거의 완료됨)
- [ ]  🟢 100% (완료 및 점검까지 완료)

📌 간단한 근거:

```
위에 언급하였다시피, Kaggle에 모델을 제출해본 뒤 성능 점수를 확인해보았다. 

이에 대해, 성능을 더 끌어올릴 수 있는 방법이 있는가를 고민하였고, 해답은 전처리 Detail에 있다 판단.

따라서, 이에 대한 추가적인 회의 진행 및 작업을 수행 중

```

---

### [4] 오늘 협업 중 제안하거나 피드백한 내용이 있다면?

> 오늘 회의나 메시지에서 당신이 제안하거나 팀에 피드백한 내용은 무엇인가요?
> 

✍️ 답변:

```
총 Train Data 232개, 기본적으로 Train Data가 과하게 불균형 & 대다수 객체는 부족하다 판단되었음.
이에 대해 전략적인 Pipeline 구성.

1. Data 겹침 분포 정도에 따라, 원본 Train Data에 대해 극히 부족한 하위 샘플 (3~9번 출현)만 따로 Copy - paste 진행해서\
얘네 위주로 기존 대비 약 30개까지만 늘리기
[8번 출현의 경우(153번과 겹침), 3번의 특수경우(45번과 겹침)도 실행. 이때, 153번 나타나는 Data를 우선적으로 배제해 Data 불균형 완화]

2. Copy-Paste 나온 거에 대해 증강 전처리 적용\
(단, 현재 전처리 코드는 원본 + 대비 + 증강 * 2 을 도출하게 되어있는데, 원본 + 증강(대비 이관)으로 구성되게)

3. 이후, YOLOv11에 학습을 진행하며 내부 기능인 Mosaic & Mixup 적용. (내부 기능은 Class 불균형을 알아서 해결)

혹은, 

원본에 대해 낮은 출현률의 Class Data Copy-Paste 적용 + 원본에 대해 낮은 출현의 Class Data를 증강 전처리 적용\
진행한 값을 합쳐, YOLOv11에 학습을 진행하며 내부 기능인 Mosaic & Mixup 적용. 

둘 다 실행해보고, 더 나은 결과 채택하기로

```

---

### [5] 오늘 분석/실험 중 얻은 인사이트나 발견한 문제점은?

> EDA, 모델 실험 중 유의미한 점이나 오류가 있었다면 자유롭게 작성하세요.
> 

✍️ 답변:

```
Dataset에서 일부 Annoation이 Bounding Box 좌표가 누락 / 비 일치 되는 현상이 발견되었다.\
이에 대해, 이전 중복 BBox 코드 값을 코드로 찾아 냈을 때와 같이 수정 작업 시행 예정.

이후, 이러한 변화에 대해 팀원 간 공유 진행할 것

```

---

### [6] 일정 지연이나 협업 중 어려웠던 점이 있다면?

> 자기 업무 외에도 전체 일정이나 팀 내 협업에서 생긴 문제를 공유해 주세요.
> 

✍️ 답변:

```
일 하나를 해결하면, 또 다른 문제가 터지고.. 를 반복하니 정신 없던 거 같았다. 
Feedback 및 회의 진행 후 [5]번 문제점 터지게 되어 이를 해결해야 할듯..


```

---

### [7] 오늘 발표 준비나 커뮤니케이션에서 기여한 부분은?

> 슬라이드 제작, 발표 연습, 질문 정리 등 발표와 관련된 활동을 썼다면 기록하세요.
> 

✍️ 답변:

```
아직 초반 단계라 발표 준비 X / 커뮤니케이션에서 여러 아이디어 제시 및 소통 진행

```

---

### [8] 내일 목표 / 할 일

> 구체적인 개인 업무나 팀 목표 기반 계획을 간단히 적어주세요.
> 

✍️ 답변:

```
[5]의 문제를 해결하기 위해, 0204에 작업 수행 예정

```
